#include <iostream>


/*
1. Задати: i = 0; ai , bi (𝑎𝑖 ≥ 𝑏𝑖
)
2. Обчислити: i = i+1; 𝑏𝑖 = 𝑎𝑖−1𝑚𝑜𝑑𝑏𝑖−1; 𝑎𝑖 = 𝑏𝑖−1;
3. Якщо bi > 0, повернутися до виконання пункту 2.
Якщо bi = 0, завершити роботу з результатом: НСД(a,b) = ai.
*/

int gcd (int a, int b){
    if(b != 0 ){
        return gcd(b, a%b);
    }
    return a;
}


/*
Хід розв’язку розглянутого прикладу можна записати в інший спосіб: 
застосовуємо послідовно співвідношення (2.1) і виконуємо цілочисельне ділення, 
аж поки не опинимося в ситуації, коли зможемо застосувати співвідношення (2.2):
211 = 79 ∙ 2 + 53 (2.4)
79 = 53 ∙ 1 + 26 (2.5)
53 = 26 ∙ 2 + 1 (2.6)
26 = 1 ∙ 26 + 0 (2.7)
Тобто: НСД(211,79) = НСД(79,53) = НСД(53,26) = НСД(26,1) = НСД(1,0) = 1.
Класичний алгоритм Евкліда вимагає максимум m кроків. Причому:
𝑚 ≤ 2 log2 𝑏 + 1 (2.8)

Для кожної пари взаємно простих чисел a і b можна знайти такі цілі u та v, 
що буде виконуватися така тотожність:
𝑢𝑎 + 𝑣𝑏 = 1


1=53+(−2)⋅26
Тепер, виразимо лишок 26 зі співвідношення (2.5) і підставимо його замість 26 у (2.11):
26=79+(−1)⋅53
Підставимо це у (2.11):
1=53+(−2)⋅(79+(−1)⋅53)
1=53+(−2)⋅79+2⋅53
1=−2⋅79+3⋅53
....


1 = (−2) ∙ 79 + 3 ∙ (211 + (−2) ∙ 79) = 3 ∙ 211 + (−8) ∙ 79

*/


int main() {
    std::cout<< gcd(4, 6);
    return 0;
}